Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: See, for example, ``.editable = LV_OBJ_CLASS_EDITABLE_TRUE`` in `lv_slider.c <https://github.com/lvgl/lvgl/blob/master/src/widgets/slider/lv_slider.c>`__.
it_it: Vedere, ad esempio, ``.editable = LV_OBJ_CLASS_EDITABLE_TRUE`` in `lv_slider.c <https://github.com/lvgl/lvgl/blob/master/src/widgets/slider/lv_slider.c>`__.

source: Select NXP G2D engine in "lv_conf.h": Set :c:macro:`LV_USE_G2D` to `1`.
it_it: Selezionare il motore NXP G2D in "lv_conf.h": Impostare :c:macro:`LV_USE_G2D` a `1`.

source: Select NXP PXP engine in "lv_conf.h": Set :c:macro:`LV_USE_PXP` to `1`.
it_it: Selezionare il motore PXP NXP in "lv_conf.h": Impostare :c:macro:`LV_USE_PXP` a `1`.

source: Select NXP VGLite engine in "lv_conf.h": Set :c:macro:`LV_USE_DRAW_VGLITE` to `1`.
it_it: Selezionare il motore NXP VGLite in "lv_conf.h": Impostare :c:macro:`LV_USE_DRAW_VGLITE` a `1`.

source: Select a Language
it_it: Selezionare una Lingua

source: Select the **Codespaces** tab.
it_it: Selezionare il tab **Codespaces**.

source: Select the :ref:`Color format <images_color_formats>`.
it_it: Selezionare il :ref:`Formato del Colore <images_color_formats>`.

source: Select the cloned folder and press ``Finish``.
it_it: Selezionare la cartella clonata e premere ``Finish``.

source: Select the installation folder of the toolchain
it_it: Si seleziona la cartella di installazione della toolchain

source: Select the plugin folder, give the source a name (e.g. "LVGL Editor Launcher") and follow the prompts to complete the installation (approve any security warnings, accept the license agreement, and finish the installation).
it_it: Selezionare la cartella del plugin, assegnare un nome al sorgente (ad esempio "LVGL Editor Launcher") e seguire le istruzioni per completare l'installazione (accettare eventuali avvisi di sicurezza, accettare il contratto di licenza e completare l'installazione).

source: Select your container from the "Remote Explorer" on the left side panel.
it_it: Selezionare il container da "Remote Explorer" nel pannello laterale sinistro.

source: Select your target project from the dropdown list.
it_it: Selezionare il progetto target dall'elenco a discesa.

source: Selecting Display Mode
it_it: Selezione della Modalità di Display

source: Selecting text
it_it: Selezione del testo

source: Selectors are also supported for local style properties:
it_it: I selettori sono supportati anche per le proprietà di stile locali:

source: Self Size
it_it: Dimensione Automatica

source: Self size is a property of a Widget.
it_it: La "Self size" [dimensione automatica] è una proprietà di un Widget.

source: Sending Events Manually
it_it: Invio Manuale di Eventi

source: Sent even if no redraw happened.
it_it: Inviato anche se non si è verificato alcun ridisegno.

source: Sent even if there is nothing to redraw.
it_it: Inviato anche se non c'è nulla da ridisegnare.

source: Separate functions exist for adding and removing styles.
it_it: Esistono funzioni separate per aggiungere e rimuovere stili.

source: Serial port reception errors caused by a high baud rate.
it_it: Errori di ricezione sulla porta seriale causati da un baud rate elevato.

source: Server-side window decorations
it_it: Decorazioni delle finestre lato server

source: Set :c:macro:`LV_USE_BARCODE` to ``1`` in ``lv_conf.h``.
it_it: Impostare :c:macro:`LV_USE_BARCODE` a ``1`` in ``lv_conf.h``.

source: Set :c:macro:`LV_USE_DRAW_VG_LITE` to 1 in ``lv_conf.h`` to enabled the VG-Lite rendering backend.
it_it: Impostare :c:macro:`LV_USE_DRAW_VG_LITE` a 1 in ``lv_conf.h`` per abilitare il backend di rendering VG-Lite.

source: Set :c:macro:`LV_USE_FILE_EXPLORER` to a non-zero value in ``lv_conf.h``.
it_it: Si imposta :c:macro:`LV_USE_FILE_EXPLORER` su un valore diverso da zero in ``lv_conf.h``.

source: Set :c:macro:`LV_USE_FREETYPE` in ``lv_conf.h`` to ``1``.
it_it: Impostare :c:macro:`LV_USE_FREETYPE` in ``lv_conf.h`` a ``1``.

source: Set :c:macro:`LV_USE_FS_LITTLEFS` in ``lv_conf.h`` to ``1`` and define an upper-case letter (as a C character type) for :c:macro:`LV_FS_LITTLEFS_LETTER` in the range ['A'..'Z'].
it_it: Impostare :c:macro:`LV_USE_FS_LITTLEFS` in ``lv_conf.h`` a ``1`` e definire una lettera maiuscola (come un carattere di tipo C) per :c:macro:`LV_FS_LITTLEFS_LETTER` nell'intervallo ['A'..'Z'].

source: Set :c:macro:`LV_USE_GLTF` to ``1`` in ``lv_conf.h``.
it_it: Impostare :c:macro:`LV_USE_GLTF` a ``1`` in ``lv_conf.h``.

source: Set :c:macro:`LV_USE_GSTREAMER` to ``1`` in ``lv_conf.h``.
it_it: Settare :c:macro:`LV_USE_GSTREAMER` a ``1`` in ``lv_conf.h``.

source: Set :c:macro:`LV_USE_LIBJPEG_TURBO` in ``lv_conf.h`` to ``1``.
it_it: Impostare :c:macro:`LV_USE_LIBJPEG_TURBO` in ``lv_conf.h`` a ``1``.

source: Set :c:macro:`LV_USE_LIBPNG` in ``lv_conf.h`` to ``1``.
it_it: Impostare :c:macro:`LV_USE_LIBPNG` in ``lv_conf.h`` a ``1``.

source: Set :c:macro:`LV_USE_LIBWEBP` in ``lv_conf.h`` to ``1``.
it_it: Impostare :c:macro:`LV_USE_LIBWEBP` in ``lv_conf.h`` a ``1``.

source: Set :c:macro:`LV_USE_TJPGD` to ``1`` in ``lv_conf.h``.
it_it: Impostare :c:macro:`LV_USE_TJPGD` a ``1`` in ``lv_conf.h``.

source: Set :c:macro:`LV_VG_LITE_FLUSH_MAX_COUNT` to a value greater than zero, such as 8.
it_it: Impostare :c:macro:`LV_VG_LITE_FLUSH_MAX_COUNT` su un valore maggiore di zero, ad esempio 8.

source: Set :c:macro:`LV_VG_LITE_FLUSH_MAX_COUNT` to zero (recommended).
it_it: Impostare :c:macro:`LV_VG_LITE_FLUSH_MAX_COUNT` a zero (consigliato).

source: Set Subject Value
it_it: Impostare il Valore di Subject

source: Set Up the Build Context, Compile, and Flash
it_it: Impostare il Build Context, Compilare e Flash-are

source: Set X coordinate of Widget considering the ``align`` setting.
it_it: Imposta la coordinata X del Widget considerando l'impostazione ``align``.

source: Set Y coordinate of Widget considering the ``align`` setting.
it_it: Imposta la coordinata Y del Widget considerando l'impostazione ``align``.

source: Set ``LV_DRAW_DMA2D_HAL_INCLUDE`` to the corresponding header.
it_it: Impostare ``LV_DRAW_DMA2D_HAL_INCLUDE`` all'header corrispondente.

source: Set ``LV_FS_FROGFS_LETTER`` to a letter like ``'F'``.
it_it: Impostare ``LV_FS_FROGFS_LETTER`` su una lettera come ``'F'``.

source: Set ``LV_USE_DRAW_DMA2D_INTERRUPT`` to ``1`` in ``lv_conf.h``.
it_it: Impostare ``LV_USE_DRAW_DMA2D_INTERRUPT`` a ``1`` in ``lv_conf.h``.

source: Set ``LV_USE_FS_FROGFS`` to ``1`` in your ``lv_conf.h``.
it_it: Impostare ``LV_USE_FS_FROGFS`` a ``1`` in ``lv_conf.h``.

source: Set ``LV_USE_OS`` to ``LV_OS_FREERTOS`` or ``LV_OS_CMSIS_RTOS2``.
it_it: Impostare ``LV_USE_OS`` a ``LV_OS_FREERTOS`` o ``LV_OS_CMSIS_RTOS2``.

source: Set ``LV_USE_OS`` to one of the supported values in ``lv_conf_template.h`` corresponding to the RTOS you're using.
it_it: Impostare ``LV_USE_OS`` su uno dei valori supportati in ``lv_conf_template.h`` corrispondente all'RTOS in uso.

source: Set ``area``, ``radius``, and ``keep_outside`` parameters.
it_it: Impostare i parametri ``area``, ``radius`` e ``keep_outside``.

source: Set ``factor`` to ``256`` or :c:macro:`LV_SCALE_NONE` to disable zooming.
it_it: Impostare ``factor`` a ``256`` o a :c:macro:`LV_SCALE_NONE` per disabilitare lo zoom.

source: Set a Menu Page in the main area
it_it: Impostare una Menu Page nell'area principale

source: Set a Menu Page in the sidebar
it_it: Impostare una Menu Page nella barra laterale

source: Set a background image.
it_it: Imposta un'immagine di sfondo.

source: Set a buffer
it_it: Impostare un buffer

source: Set a color format with alpha channel.
it_it: Impostare un formato colore con canale alfa.

source: Set a color to mix to the background image.
it_it: Imposta un colore da miscelare con l'immagine di sfondo.

source: Set a color to mix to the obj.
it_it: Imposta un colore da mescolare con obj.

source: Set a custom year list with :cpp:expr:`lv_calendar_header_dropdown_set_year_list(calendar, years_list)` where ``years_list`` is a pointer to the custom years list.
it_it: Impostare un elenco di anni personalizzato con :cpp:expr:`lv_calendar_header_dropdown_set_year_list(calendar, years_list)` dove ``years_list`` è un puntatore all'elenco degli anni.

source: Set a rootfs overlay
it_it: Impostare un overlay rootfs

source: Set a source
it_it: Impostare una sorgente

source: Set all points to a single Y-value with :cpp:expr:`lv_chart_set_all_values(chart, series, value)`.
it_it: Impostare tutti i punti su un singolo valore Y con :cpp:expr:`lv_chart_set_all_values(chart, series, value)`.

source: Set an image from which arc will be masked out.
it_it: Imposta un'immagine da cui verrà mascherato l'arco.

source: Set an offset on the shadow in pixels in X direction.
it_it: Imposta un offset dell'ombra in pixel nella direzione X.

source: Set an offset on the shadow in pixels in Y direction.
it_it: Imposta un offset dell'ombra in pixel nella direzione Y.

source: Set background color of Widget.
it_it: Imposta il colore di sfondo del Widget.

source: Set base direction of Widget.
it_it: Imposta la direzione di base del Widget.

source: Set by :c:macro:`LV_MEM_SIZE` in ``lv_conf.h``.
it_it: Impostato da :c:macro:`LV_MEM_SIZE` in ``lv_conf.h``.

source: Set cell user data
it_it: Impostare i dati utente della cella

source: Set cell value
it_it: Impostare il valore della cella

source: Set color of arc.
it_it: Imposta il colore dell'arco.

source: Set color of lines.
it_it: Imposta il colore delle linee.

source: Set color of outline.
it_it: Imposta il colore del contorno.

source: Set color of shadow
it_it: Imposta il colore dell'ombra

source: Set color of the border
it_it: Imposta il colore del bordo

source: Set color to mix with the image.
it_it: Imposta il colore da mescolare con l'immagine.

source: Set colour depth to 32:
it_it: Impostare la profondità di colore a 32:

source: Set column in which Widget should be placed.
it_it: Imposta la colonna in cui posizionare il Widget.

source: Set decoration for the text.
it_it: Imposta la decorazione del testo.

source: Set direction of the gradient of the background.
it_it: Imposta la direzione del gradiente dello sfondo.

source: Set editor to use 4 spaces for tab indentations (instead of tab characters).
it_it: Impostare l'editor in modo che utilizzi 4 spazi per le rientranze di tabulazione (invece dei caratteri di tabulazione).

source: Set fixed size in pixels:
it_it: Impostare una dimensione fissa in pixel:

source: Set font of text (a pointer `lv_font_t *`).
it_it: Imposta il font del testo (un puntatore `lv_font_t *`).

source: Set gap between dashes in pixels.
it_it: Imposta la distanza tra i trattini in pixel.

source: Set gradient color of the background.
it_it: Imposta il colore del gradiente dello sfondo.

source: Set gradient definition.
it_it: Imposta la definizione del gradiente.

source: Set horizontal alignment using :cpp:expr:`lv_arclabel_set_text_horizontal_align(arclabel, LV_ARCLABEL_TEXT_ALIGN_CENTER)`.
it_it: Impostare l'allineamento orizzontale utilizzando :cpp:expr:`lv_arclabel_set_text_horizontal_align(arclabel, LV_ARCLABEL_TEXT_ALIGN_CENTER)`.

source: Set how many columns Widget should span.
it_it: Imposta il numero di colonne che il Widget deve occupare.

source: Set how many rows Widget should span.
it_it: Imposta il numero di righe che il Widget deve occupare.

source: Set how to align Widget horizontally.
it_it: Imposta come allineare il Widget orizzontalmente.

source: Set how to align Widget vertically.
it_it: Imposta come allineare il Widget verticalmente.

source: Set how to align the lines of the text.
it_it: Imposta come allineare le righe del testo.

source: Set image colorkey definition.
it_it: Impostare la definizione del colorkey dell'immagine.

source: Set intensity of background image recoloring.
it_it: Imposta l'intensità della ricolorazione dell'immagine di sfondo.

source: Set intensity of color mixing.
it_it: Imposta l'intensità della miscelazione dei colori.

source: Set layout of Widget.
it_it: Imposta il layout del Widget.

source: Set letter space in pixels
it_it: Imposta la spaziatura delle lettere in pixel

source: Set line space in pixels.
it_it: Imposta la spaziatura delle righe in pixel.

source: Set only which side(s) the border should be drawn.
it_it: Imposta solo il lato o i lati su cui deve essere disegnato il bordo.

source: Set opacity of an image.
it_it: Imposta l'opacità di un'immagine.

source: Set opacity of arcs.
it_it: Imposta l'opacità degli archi.

source: Set opacity of lines.
it_it: Imposta l'opacità delle linee.

source: Set opacity of outline.
it_it: Imposta l'opacità del contorno.

source: Set opacity of shadow.
it_it: Imposta l'opacità dell'ombra.

source: Set opacity of text.
it_it: Imposta l'opacità del testo.

source: Set opacity of the background image.
it_it: Imposta l'opacità dell'immagine di sfondo.

source: Set opacity of the background.
it_it: Imposta l'opacità dello sfondo.

source: Set opacity of the border.
it_it: Imposta l'opacità del bordo.

source: Set opacity of the first gradient color
it_it: Imposta l'opacità del primo colore del gradiente.

source: Set opacity of the second gradient color
it_it: Imposta l'opacità del secondo colore del gradiente.

source: Set padding of outline, i.e. the gap between Widget and the outline.
it_it: Imposta il riempimento del contorno, ovvero lo spazio tra il Widget e il contorno.

source: Set pivot point's X coordinate for transformations.
it_it: Imposta la coordinata X del punto pivot per le trasformazioni.

source: Set pivot point's Y coordinate for transformations.
it_it: Imposta la coordinata Y del punto pivot per le trasformazioni.

source: Set point from which background color should start for gradients.
it_it: Imposta il punto da cui deve iniziare il colore di sfondo per i gradienti.

source: Set point from which background's gradient color should start.
it_it: Imposta il punto da cui deve iniziare il colore del gradiente dello sfondo.

source: Set points
it_it: Impostazione dei punti

source: Set radius on every corner.
it_it: Imposta il raggio su ogni angolo.

source: Set row in which Widget should be placed.
it_it: Imposta la riga in cui posizionare il widget.

source: Set text
it_it: Impostazione del testo

source: Set text and style
it_it: Impostare testo e stile

source: Set the :c:macro:`LV_USE_FFMPEG` in ``lv_conf.h`` to ``1``.
it_it: Impostare :c:macro:`LV_USE_FFMPEG` in ``lv_conf.h`` a ``1``.

source: Set the :c:macro:`LV_VG_LITE_FLUSH_MAX_COUNT` configuration to specify the flush method.
it_it: Impostare la configurazione :c:macro:`LV_VG_LITE_FLUSH_MAX_COUNT` per specificare il metodo di "flush".

source: Set the :c:macro:`LV_VG_LITE_GRAD_CACHE_CNT` configuration to specify the number of gradient cache entries.
it_it: Impostare la configurazione :c:macro:`LV_VG_LITE_GRAD_CACHE_CNT` per specificare il numero di voci della cache del gradiente.

source: Set the :c:macro:`LV_VG_LITE_STROKE_CACHE_CNT` configuration to specify the number of stroke path caches.
it_it: Impostare la configurazione :c:macro:`LV_VG_LITE_STROKE_CACHE_CNT` per specificare il numero di cache del path del tratto.

source: Set the :c:macro:`LV_VG_LITE_USE_ASSERT` configuration to enable GPU call parameter checking.
it_it: Impostare la configurazione :c:macro:`LV_VG_LITE_USE_ASSERT` per abilitare il controllo dei parametri di chiamata della GPU.

source: Set the :c:macro:`LV_VG_LITE_USE_BOX_SHADOW` configuration to use GPU rendering for shadows.
it_it: Impostare la configurazione :c:macro:`LV_VG_LITE_USE_BOX_SHADOW` per utilizzare il rendering GPU per le ombreggiature.

source: Set the Paths of Installed Tools
it_it: Impostare i Path dei Tool Installati

source: Set the alignment which tells from which point of the parent the X and Y coordinates should be interpreted.
it_it: Imposta l'allineamento che indica da quale punto dell'oggetto padre devono essere interpretate le coordinate X e Y.

source: Set the base branch where you want to merge your update.
it_it: Impostare il branch di base in cui si desidera unire l'aggiornamento.

source: Set the bottom layer's ``bg_opa`` to transparent: :cpp:expr:`lv_obj_set_style_bg_opa(lv_layer_bottom(), LV_OPA_TRANSP, LV_PART_MAIN)`
it_it: Impostare ``bg_opa`` del layer inferiore su trasparente: :cpp:expr:`lv_obj_set_style_bg_opa(lv_layer_bottom(), LV_OPA_TRANSP, LV_PART_MAIN)`

source: Set the color depth of you display in :c:macro:`LV_COLOR_DEPTH`
it_it: Impostare la profondità di colore del display in :c:macro:`LV_COLOR_DEPTH`

source: Set the color format of the gif framebuffer with :cpp:expr:`lv_gif_set_color_format(widget, color_format)`.
it_it: Si imposta il formato colore del framebuffer GIF con :cpp:expr:`lv_gif_set_color_format(widget, color_format)`.

source: Set the letter outline stroke width in pixels.
it_it: Imposta la larghezza del tratto del contorno della lettera in pixel.

source: Set the opacity of the letter outline stroke.
it_it: Imposta l'opacità del tratto del contorno della lettera.

source: Set the parameters such as Name, Size, BPP.
it_it: Impostare i parametri come Nome, Dimensione, BPP.

source: Set the radius of the arc with :cpp:expr:`lv_arclabel_set_radius(arclabel, radius)`.
it_it: Impostare il raggio dell'arco con :cpp:expr:`lv_arclabel_set_radius(arclabel, radius)`.

source: Set the screen's ``bg_opa`` to transparent: :cpp:expr:`lv_obj_set_style_bg_opa(lv_screen_active(), LV_OPA_TRANSP, LV_PART_MAIN)`
it_it: Impostare ``bg_opa`` dello schermo su trasparente: :cpp:expr:`lv_obj_set_style_bg_opa(lv_screen_active(), LV_OPA_TRANSP, LV_PART_MAIN)`

source: Set the starting angle of the arc with :cpp:expr:`lv_arclabel_set_angle_start(arclabel, angle)`.
it_it: Impostare l'angolo iniziale dell'arco con :cpp:expr:`lv_arclabel_set_angle_start(arclabel, angle)`.

source: Set the values programmatically in the array like ``ser1->points[3] = 7`` and refresh the chart with :cpp:expr:`lv_chart_refresh(chart)`.
it_it: Impostare i valori a livello di codice nell'array, ad esempio ``ser1->points[3] = 7`` e aggiornare il grafico con :cpp:expr:`lv_chart_refresh(chart)`.

source: Set time with 12/24 mode and AM/PM
it_it: Impostare l'ora con modalità 12/24 e AM/PM

source: Set to 1 if the background will cover the shadow (a hint for the renderer to skip masking).
it_it: Impostare a 1 se il background coprirà l'ombra (suggerimento per il motore di rendering di evitare il mascheramento).

source: Set to 1 to allocate a buffer and copy the text.
it_it: Impostare a 1 per allocare un buffer e copiare il testo.

source: Set to 1 to enable anti-aliasing for transformations.
it_it: Impostare su 1 per abilitare l'anti-aliasing per le trasformazioni.

source: Set to 1 to skip end calculations if they are unnecessary.
it_it: Impostare su 1 per saltare i calcoli finali se non sono necessari.

source: Set to a Value
it_it: Impostare su un Valore

source: Set translation tag
it_it: Impostare il tag di traduzione

source: Set up an LVGL :ref:`simulator`.
it_it: Configurare un :ref:`simulator` LVGL.

source: Set up drivers
it_it: Configurare i driver

source: Set width (thickness) of arcs in pixels.
it_it: Imposta la larghezza (spessore) degli archi in pixel.

source: Set width of dashes in pixels.
it_it: Imposta la larghezza dei trattini in pixel.

source: Set width of lines in pixels.
it_it: Imposta la larghezza delle linee in pixel.

source: Set width of outline in pixels.
it_it: Imposta la larghezza del contorno in pixel.

source: Set width of the border.
it_it: Imposta lo spessore del bordo.

source: Set width of the shadow in pixels.
it_it: Imposta la larghezza dell'ombra in pixel.

source: Set width or height as a percentage of the parent’s content area:
it_it: Impostare larghezza o altezza come percentuale dell'area del contenuto del genitore:

source: Sets a maximal height.
it_it: Imposta un'altezza massima.

source: Sets a maximal width.
it_it: Imposta una larghezza massima.

source: Sets a minimal height.
it_it: Imposta un'altezza minima.

source: Sets a minimal width.
it_it: Imposta una larghezza minima.

source: Sets color of text.
it_it: Imposta il colore del testo.

source: Sets height of Widget.
it_it: Imposta l'altezza del Widget.

source: Sets margin on the bottom.
it_it: Imposta il margine in basso.

source: Sets margin on the left.
it_it: Imposta il margine a sinistra.

source: Sets margin on the right.
it_it: Imposta il margine a destra.

source: Sets margin on the top.
it_it: Imposta il margine in alto.

source: Sets the color of letter outline stroke.
it_it: Imposta il colore del contorno delle lettere.

source: Sets the intensity of blurring.
it_it: Imposta l'intensità del "blurring" [sfocatura].

source: Sets the intensity of color mixing.
it_it: Imposta l'intensità della miscelazione dei colori.

source: Sets the padding between the columns.
it_it: Imposta il padding tra le colonne.

source: Sets the padding between the rows.
it_it: Imposta il padding tra le righe.

source: Sets the padding on the bottom.
it_it: Imposta il padding in basso.

source: Sets the padding on the left.
it_it: Imposta il padding a sinistra.

source: Sets the padding on the right.
it_it: Imposta il padding a destra.

source: Sets the padding on the top.
it_it: Imposta il padding in alto.

source: Sets whether the border should be drawn before or after the children are drawn.
it_it: Indica se il bordo deve essere disegnato prima o dopo i figli.

source: Sets width of Widget.
it_it: Imposta la larghezza del widget.

source: Setting Names
it_it: Impostazione dei Nomi

source: Setting Parameters
it_it: Impostazione dei Parametri

source: Setting State Programmatically
it_it: Impostazione dello Stato Tramite Programmazione

source: Setting Up Your Display(s)
it_it: Configurazione del/i Display

source: Setting a 100 ms transition time in the pressed state causes a 100 ms transition when going to the pressed state.
it_it: Impostando un tempo di transizione di 100 ms nello stato premuto, si ottiene una transizione di 100 ms quando si passa allo stato premuto.

source: Setting a Range for a Subject
it_it: Impostazione di un Intervallo per un Subject

source: Setting a Subject's Value
it_it: Impostazione del Valore di un Subject

source: Setting configuration macro :c:macro:`LV_USE_OBJ_PROPERTY_NAME` to ``1`` enables the following functions to look up property IDs by passing property name (a string):
it_it: Impostando la macro di configurazione :c:macro:`LV_USE_OBJ_PROPERTY_NAME` a ``1``, le seguenti funzioni possono cercare gli ID proprietà passando il nome della proprietà (una stringa):

source: Setting indicator programmatically
it_it: Impostazione dell'indicatore tramite programmazione

source: Setting range
it_it: Impostazione del range

source: Setting scroll position can be done with these functions:
it_it: L'impostazione della posizione di scorrimento può essere effettuata con queste funzioni:

source: Setting tab bar position
it_it: Impostare la posizione della barra delle schede

source: Setting tab bar size
it_it: Impostare le dimensioni della barra delle schede

source: Setting the ``data->continue_reading`` flag will tell LVGL there is more data to read and it should call ``read_cb`` again.
it_it: Impostando il flag ``data->continue_reading``, LVGL indicherà che ci sono più dati da leggere e che dovrebbe richiamare ``read_cb``.

source: Setting the list items
it_it: Impostazione degli elementi della lista

source: Setting to `LV_BLUR_QUALITY_SPEED` the blurring algorithm will prefer speed over quality.
it_it: Impostando `LV_BLUR_QUALITY_SPEED`, l'algoritmo di sfocatura preferirà la velocità alla qualità.
